<template>
	<view>
		<view class="new-sign">
			<text>重要提示：</text>
			<text>感谢您选择注册并使用指间礼物，在使用指间服务</text>
			<text>前，请您仔细阅读以下条款，并确认您已完全理解本</text>
			<text>协议之规定，尤其是免除及限制责任的条款、知识产</text>
			<text>权条款、法律适用及争议解决条款。</text>
			<text>若您对本声明或本协议任何条款有异议，请停止注册</text>
			<text>或使用指间礼物（包括网站、微信小程序等，下同）</text>
			<text>所提供的全部服务。</text>
			<text>一、协议的接受、变更与补充</text>
			<text>1、点击“快捷登录/注册”，将视为您签署了本协议，</text>
			<text>表明您自愿接受本协议全部条款的约束，本协议将构</text>
			<text>成您与北京购实惠电子商务有限公司及其经营的“指</text>
			<text>间礼物”平台（以下统称“指间礼物”，包括相关关联</text>
			<text>方）之间具有约束力的法律文件。无论您是进入指间</text>
			<text>礼物浏览网页，还是在指间礼物上购买产品或服务，</text>
			<text>或者是直接或通过各类方式（如站外API引用等）间</text>
			<text>接使用指间礼物的服务和数据的行为，都将被视作已</text>
			<text>无条件接受本声明所涉全部内容。</text>
			<text>2、指间礼物有权利对本协议进行修改，协议修改</text>
			<text>后，指间礼物将通过在相关页面公告或发送通知等方</text>
			<text>式公布修改的内容，修改后的协议一经公布即有效的</text>
			<text>代替原协议。如果您不同意本协议的修改，请立即停</text>
			<text>止访问或使用网站或取消已经获得的服务；如果您选</text>
			<text>择继续访问或使用指间礼物，则视为您已接受本协议</text>
			<text>的修改。</text>
			<text>3、签署的本协议所列明的条款，并不能完全涵盖您</text>
			<text>与指间礼物之间所有的权利和义务。因此，指间礼物</text>
			<text>不定期公布的其他声明、规则等均视为本协议之补充</text>
			<text>协议，为本协议不可分割的组成部分，与本协议具有</text>
			<text>同等法律效力。</text>
			<text>4、如本协议与指间礼物平台其它协议条款不一致，</text>
			<text>以其它协议条款内容为准。</text>
			<text>二、帐号与注册、登录</text>
			<text>1.您确认，在您开始注册指间礼物前，已经具备中华</text>
			<text>人民共和国法律规定的与您行为相适应的民事行为能</text>
			<text>力。若您不具备前述与您行为相适应的民事行为能</text>
			<text>力，则您及您的监护人应依照法律规定承担因此而导</text>
			<text>致的一切后果。</text>
			<text>2.您注册成功后，即成为指间礼物注册用户，用户须</text>
			<text>对在指间礼物的注册信息的真实性、合法性、有效性</text>
			<text>承担全部责任。</text>
			<text>三、用户个人信息</text>
			<text>1、个人信息的保护</text>
			<text>(1)保护用户个人信息及个人隐私是指间礼物的基本原</text>
			<text>则之一。</text>
			<text>(2)指间礼物将运用各种安全技术和程序建立完善的管</text>
			<text>理制度来保护您的个人信息，以免遭受未经授权的访</text>
			<text>问、使用或披露。</text>
			<text>(3)未经您的同意，指间礼物不会向指间礼物以外的任</text>
			<text>何公司、组织和个人披露您的个人信息，但法律法规</text>
			<text>另有规定的除外。</text>
			<text>(4)指间礼物非常重视对未成年人个人信息的保护，若</text>
			<text>未成年人（尤其是十岁以下）希望得以使用指间礼物</text>
			<text>提供的服务，必须得到父母（监护人）的同意。</text>
			<text>(5)指间礼物将通过技术手段、强化内部管理等办法充</text>
			<text>分保护用户的个人隐私信息，保证不对外公开或向第</text>
			<text>三方披露或提供用户注册资料及用户在使用网络服务</text>
			<text>时存储在指间礼物平台、服务器或数据库的非公开内</text>
			<text>容和信息，但下列情况除外：</text>
			<text>1) 事先获得用户的授权；</text>
			<text>2) 根据有关的法律法规要求；</text>
			<text>3) 按照相关政府主管部门和司法机关的要求；</text>
			<text>4) 为维护社会公众的利益；</text>
			<text>5) 为维护指间礼物的合法权益。</text>
			<text>2、个人信息的收集</text>
			<text>指间礼物在提供服务时，可能会收集、储存和使用下</text>
			<text>列与您有关的信息。如果您不提供相关信息，可能无</text>
			<text>法注册成为我们的用户或无法享受我们提供的某些服</text>
			<text>务，或者无法达到相关服务拟达到的效果。</text>
			<text>(1) 您提供的信息</text>
			<text>1.您在注册帐户或使用指间礼物的服务时，向我们提</text>
			<text>供的相关个人信息，包括但不限于真实姓名、证件</text>
			<text>信息、电话号码、地址、电子邮件等；</text>
			<text>2.您通过指间礼物的服务向其他方提供的共享信</text>
			<text>息，以及您使用我们的服务时所储存的信息。</text>
			<text>(2)我们获取的您的信息</text>
			<text>您使用指间礼物服务时我们可能收集如下信息：使用</text>
			<text>指间礼物服务时，系统可能通过cookies、web </text>
			<text>beacon或其他方式自动采集的技术信息，包括：</text>
			<text>1) 设备或软件信息，包括但不限于您的移动设备、网</text>
			<text>页浏览器或用于接入我们服务的其他程序所提供的配</text>
			<text>置信息、您的IP地址、位置信息、设备存储和移动设</text>
			<text>备所用的版本和设备识别码；</text>
			<text>2) 在使用我们服务时搜索或浏览的信息，包括但不限</text>
			<text>于您浏览过的文章、搜索的关键词，以及您在使用我</text>
			<text>们服务时浏览或要求提供的其他信息和内容详情；</text>
			<text>3、个人信息的使用</text>
			<text>(1)我们可能将在向您提供服务的过程之中所收集的信</text>
			<text>息用作下列用途：</text>
			<text>1) 向您提供服务；</text>
			<text>2) 在我们提供服务时，用于身份验证、客户服务、安</text>
			<text>全防范、诈骗监测、存档和备份用途，确保我们向您</text>
			<text>提供的产品和服务的安全性；</text>
			<text>3) 帮助我们设计新服务，改善我们现有服务；</text>
			<text>4) 使我们更加了解您如何接入和使用我们的服务，从</text>
			<text>而针对性地回应您的个性化需求，例如个性化的帮助</text>
			<text>服务和指示，或对您和其他用户作出其他方面的回应；</text>
			<text>5) 软件认证或管理软件升级；</text>
			<text>6) 让您参与有关我们产品和服务的调查。</text>
			<text>(2)为了让您有更好的体验，也为了改善我们的服务，</text>
			<text>在符合相关法律法规的前提下，我们可能将通过某一</text>
			<text>项服务收集信息或向第三方提供用户的非个人隐私信</text>
			<text>息的方式，用于我们的其他服务。例如，在您使用我</text>
			<text>们的一项服务时所收集的信息，可能会用于向您提供</text>
			<text>特定内容，或向您展示与您相关的、非普遍推送的信</text>
			<text>息。</text>
			<text>四、指间礼物的服务</text>
			<text>1、指间礼物的服务</text>
			<text>(1)指间礼物是一个信息分享及传播的购物送礼平台。</text>
			<text>指间礼物向用户提供包括但不限于如下服务：文章、</text>
			<text>图片、视频的发布、修改、删除、评论、赞赏、分</text>
			<text>享；参与线上或线下活动；付费内容服务；电子商</text>
			<text>务、购物服务等。指间礼物有权对前述服务内容进行</text>
			<text>增减或调整。除非本协议另有其它明示规定，指间礼</text>
			<text>物增加或强化目前本服务的任何新功能，包括所推出</text>
			<text>的新产品，均受本使用协议之规范。</text>
			<text>(2)用户通过指间礼物发表的信息为公开的信息，其他</text>
			<text>第三方均可以通过指间礼物获取用户发表的信息，用</text>
			<text>户对任何信息的发表即认可该信息为公开的信息，并</text>
			<text>单独对此行为承担法律责任；任何用户均不应在指间</text>
			<text>礼物上进行发表不愿被其他第三人获知的信息。</text>
			<text>2、指间礼物服务的使用</text>
			<text>(1)您在使用本服务过程中，不得以任何方式利用指间</text>
			<text>礼物直接或间接从事违反中国法律、以及社会公德的</text>
			<text>行为，应当遵守尊重不同地区、地域的道德和风俗习</text>
			<text>惯，并且应避免因使用本服务而使指间礼物卷入政治</text>
			<text>和公共事件。</text>
			<text>(2)指间礼物有权对用户使用指间礼物的情况进行审查</text>
			<text>和监督，如用户在使用指间礼物时违反任何上述规</text>
			<text>定，指间礼物或其授权的人有权要求用户改正或直接</text>
			<text>采取一切必要的措施（包括但不限于更改或删除用户</text>
			<text>发布的内容、暂停或终止用户使用指间礼物的权利）</text>
			<text>以减轻用户不当行为造成的影响。</text>
			<text>(3)用户违反上述规定并造成严重后果的，指间礼物除</text>
			<text>暂停或终止对您的服务，解除双方间的服务协议和法</text>
			<text>律关系外，无需退还您所支付的费用（如有），视为</text>
			<text>您支付的违约金，如违约金不足以弥补指间礼物的损</text>
			<text>失的，指间礼物还可通过其他法律途径向您追索。</text>
			<text>3、用户等级分类表</text>
			<text>等级分类</text>
			<text>1	普通用户</text>
			<text>2	企业用户</text>
			<text>4、具体权限的开通</text>
			<text>用户开通指间礼物平台具体功能或权限时（包括但不</text>
			<text>限购物、积分商城等），指间礼物可能将根据您登录</text>
			<text>帐号的具体情况以及届时的指间礼物政策、规定，与</text>
			<text>您签订具体子协议，若您对不同意子协议内容，可能</text>
			<text>无法使用相关服务或功能。</text>
			<text>5、按现状提供服务</text>
			<text>您理解并同意，指间礼物的服务是按照现有技术和条</text>
			<text>件所能达到的现状提供的。指间礼物会尽最大努力向</text>
			<text>您提供服务，确保服务的连贯性和安全性；但不能随</text>
			<text>时预见和防范法律、技术以及其他风险，包括但不限</text>
			<text>于不可抗力、病毒、木马、黑客攻击、系统不稳定、</text>
			<text>第三方服务瑕疵、政府行为等原因可能导致的服务中</text>
			<text>断、数据丢失以及其他的损失和风险。</text>
			<text>6、设备</text>
			<text>(1) 您应当理解，您使用指间礼物的服务需自行准备</text>
			<text>与相关服务有关的终端设备（如电脑、调制解调器等</text>
			<text>装置），并承担所需的费用（如电话费、上网费等费</text>
			<text>用）。</text>
			<text>(2) 您理解并同意，您使用本服务时会耗用您的终端</text>
			<text>设备和带宽等资源。</text>
			<text>7、广告</text>
			<text>(1) 您同意指间礼物可以在提供服务的过程中自行或</text>
			<text>由第三方广告商向您发送广告、推广或宣传信息（包</text>
			<text>括商业与非商业信息），其方式和范围可不经向您特</text>
			<text>别通知而变更。</text>
			<text>(2) 指间礼物依照法律的规定对第三方广告商履行相</text>
			<text>关义务，您应当自行判断广告信息的真实性并为自己</text>
			<text>的判断行为负责，除法律明确规定外，您因依该广告</text>
			<text>信息进行的交易或前述广告商提供的内容而遭受的损</text>
			<text>失或损害，指间礼物不承担责任。</text>
			<text>(3) 您同意，对指间礼物服务中出现的广告信息，您</text>
			<text>应审慎判断其真实性和可靠性，除法律明确规定外，</text>
			<text>您应对依该广告信息进行的交易负责。</text>
			<text>(4) 您同意，所有对您收取费用的服务或功能，均不</text>
			<text>能免除您接受指间礼物所提供的广告。因为这是指间</text>
			<text>礼物为所有用户提供综合服务的有效对价，您阅读本</text>
			<text>协议即视为对该规则的理解和接受。</text>
			<text>五、知识产权声明</text>
			<text>指间礼物是一个信息分享及传播的购物送礼平台，一</text>
			<text>直鼓励用户的积极参与，认识到保护知识产权对指间</text>
			<text>礼物生存与发展的重要性，承诺将保护知识产权作为</text>
			<text>指间礼物运营的基本原则之一。基于该项基本原则，</text>
			<text>您应当同意：</text>
			<text>六、违法行为</text>
			<text>您在使用本服务时须遵守法律法规，不得利用本服务</text>
			<text>从事违法违规行为，以及不得利用指间礼物服务制</text>
			<text>作、上载、复制、发布、传播或者转载如下内容，包</text>
			<text>括但不限于：</text>
			<text>(1) 反对宪法所确定的基本原则的；</text>
			<text>(2) 危害国家安全，泄露国家秘密，颠覆国家政权，</text>
			<text>破坏国家统一的；</text>
			<text>(3) 损害国家荣誉和利益的；</text>
			<text>(4) 煽动民族仇恨、民族歧视，破坏民族团结的；</text>
			<text>(5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</text>
			<text>(6) 侮辱或者诽谤他人，侵害他人合法权益的；</text>
			<text>(7) 含有法律、行政法规禁止的其他内容的信息。</text>
			<text>七、 不可抗力与免责</text>
			<text>1、您理解并同意，在使用简指间礼物服务的过程</text>
			<text>中，可能会遇到不可抗力等风险因素，使指间礼物提</text>
			<text>供的服务发生中断。不可抗力是指不能预见、不能克</text>
			<text>服并不能避免且对一方或双方造成重大影响的客观事</text>
			<text>件，包括但不限于自然灾害如洪水、地震、瘟疫流行</text>
			<text>和风暴等，以及社会事件如战争、动乱、政府行为</text>
			<text>等。出现上述情况时，指间礼物将努力在第一时间与</text>
			<text>相关单位配合，及时进行修复，但是由此给您造成的</text>
			<text>损失，指间礼物在法律允许的范围内免责。</text>
			<text>2、在法律允许的范围内，指间礼物对以下情形导致</text>
			<text>的服务中断或受阻不承担责任：</text>
			<text>(1) 受到计算机病毒、木马或其他恶意程序、黑客攻</text>
			<text>击的破坏；</text>
			<text>(2) 用户或指间礼物的电脑软件、系统、硬件和通信</text>
			<text>线路出现故障；</text>
			<text>(3) 用户操作不当；</text>
			<text>(4) 用户通过非指间礼物授权的方式使用指间礼物服</text>
			<text>务；</text>
			<text>(5) 其他指间礼物无法控制或合理预见的情形。</text>
			<text>3、您理解并同意，在使用指间礼物服务的过程中，</text>
			<text>可能会遇到网络信息或其他用户行为带来的风险，指</text>
			<text>间礼物不对非指间礼物发布的任何信息的真实性、适</text>
			<text>用性、合法性承担责任，也不对因侵权行为给您造成</text>
			<text>的损害负责。这些风险包括但不限于：</text>
			<text>(1) 来自他人匿名或冒名的含有威胁、诽谤、令人反</text>
			<text>感或非法内容的信息；</text>
			<text>(2) 因使用本协议项下的服务，遭受他人误导、欺骗</text>
			<text>或其他导致或可能导致的任何心理、生理上的伤害以</text>
			<text>及经济上的损失；</text>
			<text>(3) 其他因网络信息或用户行为引起的风险。</text>
			<text>4、您理解并同意，指间礼物提供的服务并非为某些</text>
			<text>特定目的（包括但不限于核设施、军事用途、医疗设</text>
			<text>施、交通通讯等重要领域）而设计，如果因为软件或</text>
			<text>服务的原因导致上述操作失败而带来的人员伤亡、财</text>
			<text>产损失和环境破坏等，指间礼物不承担法律责任。</text>
			<text>九、 服务的中止与终止</text>
			<text>1、 指间礼物可能会对提供的服务内容进行不定时的</text>
			<text>变更，也可能会中断、中止或终止服务。</text>
			<text>2、 如发生下列任何一种情形，指间礼物有权不经通</text>
			<text>知而中断或终止向您提供的服务：</text>
			<text>(1) 根据法律规定您应提交真实信息，而您提供的个</text>
			<text>人资料不真实、或与注册时信息不一致又未能提供合</text>
			<text>理证明；</text>
			<text>(2) 您涉嫌违反相关法律法规规定；</text>
			<text>(3) 按照法律规定或主管部门的要求；</text>
			<text>(4) 出于安全的原因或其他必要的情形；</text>
			<text>(5) 本协议中明确约定的其他情形。</text>
			<text>十、 法律适用与争议解决</text>
			<text>1、 本协议签订地为中华人民共和国北京市丰台区。</text>
			<text>2、 本协议的成立、生效、履行、解释及纠纷解决，</text>
			<text>适用中华人民共和国大陆地区法律（仅为本合同之目</text>
			<text>的，不包括香港、台湾、澳门地区）。</text>
			<text>3、 若您和指间礼物之间发生任何纠纷或争议，首先</text>
			<text>应友好协商解决；协商不成的，您同意将纠纷或争议</text>
			<text>提交本协议签订地人民法院管辖。</text>
			<text>4、 本协议所有条款的标题仅为阅读方便，本身并无</text>
			<text>实际涵义，不能作为本协议涵义解释的依据。</text>
			<text>5、 本协议条款无论因何种原因部分无效或不可执</text>
			<text>行，其余条款仍有效，对双方具有约束力。</text>
			<text>十一、 其他</text>
			<text>1、 指间礼物将根据平台功能区分或其他需要制订其</text>
			<text>他子协议，如子协议约定与本协议不一致，优先适用</text>
			<text>子协议条款；子协议未涉及的事宜，仍以本协议为</text>
			<text>准。</text>
			<text>2、 如果您对本协议或本服务有意见或建议，可与指</text>
			<text>间礼物客服联系，我们会给予您必要的帮助。</text>
		</view>
	</view>
</template>

<script>
	import sr from 'sr-sdk-wxapp';
	export default {
		data() {
			return {
				
			}
		}, 
		
		onLoad:function(e){
			
		},
		
		methods: {
			
			
			
		}
	}
</script>

<style>
@import '@/common/index.css';
page{
	background-color: #FFFFFF;
}
.new-sign{
	display: flex;
	    flex-direction: column;
	    padding: 20rpx 40rpx 30rpx 30rpx;
}
.new-sign text{
	line-height: 40rpx;
}

</style>
